export interface TimelineItem {
  id: string
  title: string
  description: string
  date: string
}

export const timelineData: TimelineItem[] = [
  {
    id: 'met',
    title: 'ሀምሌ 19 የገብርኤል ዋዜማ',
    description:
      'The moment our paths crossed, my heart knew something beautiful had begun. አላውቅሽም ግን ልቤ ዝም ብሎ አመነና አይቶ ወደደሽ። በለሊት ሊተዋወቅሽ መጣ። ስልክ ተቀበለሽ ደስ አለው። ከዛ በፊት ብዙ ቆንጆ ሴቶችን አይቶ አድንቋል በእግዜር አሰራር ተደንቋል ግን አንድም ቀን ሊተዋውቅ ሞክሮ አያቅም። ለመጀመሪያ ጊዜ ቅድስት የምትባል ሴትን ወደ ሂወቱ አስገባ። በበነጋታው የሰጠሽው ስልክ የውሸት እንደሆነ ተረዳ አይ በቃ ለኔ አላለውም አለ። አላዘነም ሂዎቱን መኖር ቀጠለ። ጭማሪ ትምህርት ግን አገናኘን ገረመኝ። እናም ለመተዋወቅ የተሰማኝን ነገር ለመግለጽ ሞከርሁ። ትንሽ እንደፈጠንሁ ይገባኛል። ግን የእውነት የኔ ሴት ከሆነች ይህን አረጋግጨ ነው መውጣት ያለብኝ በሚል ነገሩን በግልጽ ነገርሁሽ። ላንቺ እንግዳ መስሎ ተሰማሽ። አንዴ ደና ስንሆን አንዴ ስንጣላ ቆየን። ለመተው ቆረጥሁ። መልሰሽ ትመጫለሽ። ትዝ ይልሻል ጥያቄየን አንስቻለሁ ካልሁሽ በኋላ ላይበራሪው ጋ እኔን ሰላም ለማለት የመጣሽበት መንገድ ፍላጎት እንዳለሽ የሚያሳይ እንደነበር ነው የተረዳሁት። አሁን ግን የጣልሽውን ነጥብ ለማስቆጠር እንደመጣሽ ነው የገባኝ። ሰላም ማለት ምኑ ነው ፍላጎት እንዳለው የሚያሳይ ካልሽ G-1 ላይ ማታ እየተያየን ባላየ ለማለፍ የሞከርሽ ሴት ይቅርታ ብዩ ጥያቄየን አንስቻለው ካልሁሽ በኋላ ምን አመጣሽ? ነው መልሴ።',
    date: 'The Beginning',
  },
  {
    id: 'conversation',
    title: 'የመጀመሪያ የእግር ጉዞ',
    description:
      'ደስ የሚል ትውውቅ ነበር። ሁለታችንም ስለተዋወቅን በጣም ደስ የሚል ስሜት እንደነበረው የተሰማኝ ቀን ነበር። እና ከግቢ እስክወጣ ካንቺ ጋር እያንዳንዷን moment ማጣጣም ስለነገ መልካም ራዕይ በእምነት ስለመጣል ብቻ ነበር የማስበው። ጉጉቴ አይጣል ነው። ሚገርመው የብዙ ጊዜ ልፋቶቸን በረከት እየተቀበልሁ የነበርሁበት ጊዜ ነበር። እና አንቺንም ሳገኝሽ በቃ ሚስቴንም አገገኘሁ ነበር ያልሁት። ምንም ሚጎለኝ ነገር የለምና። ማንም ቅጥር በሚዳክርበት እኔ በእግዚያብሄር ታደልሁና የሶፍትዌር ድርጅት መክፈት የቻልሁበት።  ትልልቅ ባለብዙ ሚሊዮን ብር ፕሮጀት እያጠናቀቅሁ የነበርሁበት ጊዜ ላይ አንቺን ማግኜቴ የትየለሌ ደስታ ነበር የፈጠረልኝ። ለምን ሰብሰብ ማለትን እወዳለሁ። even ሰው ገንዘብ ሲያገኝ ይበላሻል ይባላል። እኔ ሳገኝ ግን መበላሸት አልፈልግም እል ነበር። እና አንቺ የኔን ፍላጎት የምታሟይ ሴት እንደሆነሽ ነበር ያሰብኩት። እናም ገፍቼ ለመምጣት ነበር የሞከርሁት።  አንቺ ግን እምነትሽ ከባድ ነው። ልታምኝኝ አልቻልሽም። እንደትዕቢት አይቆጠርብኝኛ እኔን የመሰለ ህልም ያለው እራሱን በደንብ የሚያውቅ ለሰዎች በጎን የሚያስብ ሁሌም ነገሮችን በቀናነት እንዲታዩ የሚፈልግ ጨዋታን የሚወድ ልጅ የትም አታገኝም! ይህን ከጎንሽ ስለሚቀለድባቸው ሴቶች አይተሽ መረዳት ትችያለሽ። አልያ አንድ ቀን ይገጥምሽና ታቂዋለሽ።',
    date: 'First Words',
  },
  {
    id: 'promise',
    title: 'ቃል ኪዳኔ',
    description:
      'ብታምኝም ባታምኝም exit ፈተና አርብ ከተፈተን በኋላ በራሴ ጎን ያለውን የቴሌግራም ታሪክ አስወግጀ ካንቺ ጋር ያለኝ ግንኙነት እንዳበቃ ለሁለተኛ ጊዜ አስቤ ነበር። ላላወራሽ ቁርጥ አድርጌ። ከዛ ሰኞ ፈተና እንዴት ነበር ብለሽ ቴክስት ላክሽልኝ። ያኔ ታስበኛለች ማለት ነው መረዳት ያዝኩ። እንደገና ማውራት ጀመርን። እንደፈለግሽ እየዘገየሽ የፈለገሽን እየተናገርሽ ብቻ ብዙ ነገር እያደረግሽ ለመታገስ እና በትዕግስት ለመጠበቅ ወሰንኩ። እናም እስከ ትናንትና ሀሙስ ድረስ መጣን። በተቻለኝ መጠን ባንቺ ቦታ ሆኘ ለመረዳት ስጋትሽን ጥርጣሬሽን በሙሉ ሞክርሁ። ከባድ የሆነውን ቃሌን እኔ ታናሽ ልሁን፣ ቃሌን ልጠፍና ብዩ ቃል ገባሁልሽ። በዚህ ሁሉ ግን እኔን ትረጅኛለሽ ከሚል መነሻ ነበር። ምን ተረዳሁ አሁን አውቆ የተኛን ብትቀሰቅሰው አይሰማም ይባላል። እንቺ ሆየ ለካ ተኝተሻል። ምን እንደሚያናድደኝ ታቂያለሽ እንድታምኝኝ ብዩ የማይገባሽን ቃል እኔነቴን ማካፈሌ ነው። በዚች ቀን አንቺም ስለጸለይሽልኝ ፕሮጀክት መሳካት አብረን በደስታ አሳልፈነው ቢሆን እንዴት ትርጉም ያለው ሂዎት በወጣን መሰለሽ። አንቺ ወደ ኋላ እየሄድሽ ሜሴጅሽን ስታጠፊ እግዚያብሄር ፕሮጄክቴን እያሳካልኝ ነበር። እናም አሳካሁት። ከዚህ ስኬት ላይ ያንቺም የጸሎት ድርሻ አለበት ይሆናልና አመሰግናለሁ ማለት እወዳለሁ በዚሁ አጋጣሚ።  ከዛ አንቺን መውደዴ ይቀጥላል። ዕጣችን አንድ ከሆነ የኔ አሻፈረኝ ያንቺ አሻፈረኝ ሁለታችን በአንድ ጎጆ ከማድረግ ምንም ጉልበት የለውም። ምክንያቱም ፍቅር ቦታውን ያውቃል። ቦታዋን እስክትይዝ ስቃይ ብቻ እናተርፍ ካለሆነ በቀር። እናም የሰጠሁሽን ቃል እጠብቅልሻለሁ ድንገት ወስጥሽ ሂጂ ካለሽ ነይ ያለምንም ትዝብት ይቀበልሻል። ',
    date: 'Forever',
  },
  {
    id: 'today',
    title: 'ዛሬ ልደሽ ነው!',
    description:
      'የ22 አመት የልደት በዓልሽን እያከበርን ነው! እንኳን ተወለድሽ ነፍ አመት ኑሪ ስትኖሪም ሁሌም በደስታ ብቻ እንዲሆንልሽ ከልቤ እመኝልሻለሁ። ስላወቅሁሽ ደስ ይለኛል። ስለወደድኩሽም የማላፍርበት ደስታዩ ነው። ደስ ብሎኝ የማወራው ታሪኬ ነው። እና እንደዚህ አይነት መልእክቶች እንደማያስደስቱሽ አውቃለሁ፤ ነገር ግን መፈጠርሽና መወለድሽ፣ ብሎም መተዋወቃችን ትልቅ ደስታ ነው። እንኳን ተወለድሽልኝ! ሺ ዓመት በሰላምና በጥበብ ኑሪ። መልካም ልደት የኔ ቅድስት ተስፋዬ !!',
    date: 'Your Birthday',
  },
  {
    id: 'future',
    title: 'ነጋችን',
    description:
      'ነጋችንን ላንቺና ለፈጣሪ ትቸዋለሁኝ። ከፈጣሪ ፈቃድ ጋር ግን ታሪኩን ምትጽፊው አንቺና አንቺ ብቻ ነሽ!! ይህን ማስታውስ እፈልጋለሁ።',
    date: 'To Come',
  },
]
